{"2a20918b8207982a":"<div></div><div><div><div><b>Wanted: Aspiring software developers who are fast learners and great communicators who want to join one of the Top Employers for Young People and one of top 5 SaaS companies in Canada!</b></div><div><br>\n</div><div><b>\nStart date: September 2019</b></div><div><br>\n</div><div>\nVision Critical provides a cloud-based customer intelligence platform that allows companies to build engaged, secure communities of customers they can use continuously, across the enterprise, for ongoing, real-time feedback and insight. Designed for today&rsquo;s always-on, social and mobile savvy customer, Vision Critical&rsquo;s technology helps large, customer-centric enterprises discover what their customers want so they can deliver what they need. Unlike traditional customer research, which is slow, expensive and gathers dust on a shelf, Vision Critical&rsquo;s customer intelligence platform replaces static data and cumbersome reports with real-time actionable customer intelligence that companies need to build better products, deliver better services and achieve better business outcomes.</div></div><div><div><h3 class=\"jobSectionHeader\"><b>\nWho You Are</b></h3><div><ul><li>\nA Computer Science or Engineering student wanting to prove yourself, test your limits, build great software, and be mentored by top notch developers</li><li>\nA team player who will contribute to an Agile team as an engineer building our industry leading SaaS product suite</li><li>\nDriven, focused and results-oriented always looking to learn cutting-edge technologies</li><li>\nLooking to open doors and start your career with one of the Top SaaS companies in Canada</li><li>\nVery confident with at least one modern programming language</li><li>\nEnjoy learning from hands on experiences such as Hackathons</li><li>\nSomeone who wants to embrace a work/life balance so you can enjoy all that <b>Vancouver</b> has to offer</li></ul></div></div></div><div><div><h3 class=\"jobSectionHeader\"><b>\nWhat You&rsquo;ll Learn: Develop using a variety of cutting edge tools and technologies</b></h3><div><ul><li><b>\nLanguages</b>: C#, HTML5, JavaScript UI Frameworks (JQuery, AngularJS, ReactJS), CSS3, NodeJS, Python, .NET Technologies</li><li><b>\nDatabases:</b> SQL Server, Oracle, PostgreSQL, Redshift</li><li><b>\nTesting:</b> NUnit, Selenium, Specflow</li><li><b>\nAWS Services:</b> Virtual Servers, Load Balancing, Lambda, S3, CloudFront, Redshift, API Gateway, Glue, Kinesis and many others</li><li><b>\nFrameworks:</b> Terraform and serverless.com</li></ul></div></div></div><div><div><h3 class=\"jobSectionHeader\"><b>\nWhat You'll Learn: Progessive development methodologies</b></h3><div><ul><li>\nFast-paced agile environment with one week sprints</li><li>\nContinuous integration, continuous delivery</li><li>\nTest driven development, paired programming</li></ul></div></div></div><div><div>\nWant an insider's view of Vision Critical? Check out a day in the life of a software developer at VC!</div><div>\n</div><div>\nHere is the view from our Vancouver office: http://webcam.visioncritical.com/</div><div>\n</div><div>\nAt the end of the work term, if there is a great fit, Vision Critical may provide students with the opportunity to take on full-time positions!\n</div><div></div><div>If this sounds like the perfect opportunity for you, we invite you to apply online now. Please include your school transcripts with your resume or cover letter.</div><div><br>\n</div><div><b>\nReady to join our team?</b></div><div>\n</div><div>\nIf you are interested in helping Vision Critical deliver on its commitments and taking your career to the next level, we invite you to apply online now.</div><div>\n</div><div>\nPlease note that due to the high volume of applications received, only short-listed candidates will be contacted.</div><div>\n</div><div>\nThank you for your interest in Vision Critical.</div></div></div><div></div>","6ede256bc5a60d35":"<p><b>We are StormFree</b></p><p>StormFree Cloud Corporation (StormFree) is constructing the future of cloud-driven enterprise services. Designed to enable businesses to regain control of their data without sacrificing security, the StormFree Platform provides highly-flexible integrations that support interoperability at all levels of infrastructure, while embracing the expandability of cloud computing. We empower companies to easily, effectively, and affordably deploy and manage technology services within their own ecosystem.</p><p>The StormFree team enjoys a strong and interactive remote working culture, with the benefit of a healthy commute-free lifestyle that helps promote work-life balance. Our teams are diligent, innovative, and optimally-sized to fit our SDLC and project management structure. Each team member provides a valuable voice and plays an important role in our mission to explore, leverage, and develop modern technology solutions. StormFree is a synergistic, skilled, and focused organization, captained by experienced leaders with long-term vision and comprehensive technical backgrounds.</p><p>To learn more about StormFree, please check our website at https://www.stormfree.cloud.</p><p><b>We Invite You: </b><br/>StormFree Cloud Corporation is looking for a Senior React Web Developer with solid experience with front-end JavaScript UI, remote API integration, and quality assurance. Note this role can be referred to by alternative names including Web Application Developer, JavaScript Programmer, and Full Stack Front End Engineer. The React Web Developer plays a key role in delivering high quality products to licensees and end users.</p><p>As a React Web Developer, you will work closely with the project manager and skilled development team focusing on building and maintaining applications using modern JavaScript with the React JS framework and possibly React-Native. This role provides the opportunity to lead and influence the direction of future projects. We are seeking a great communicator and team player who is passionate about technology, excited to be part of a fresh, enterprising venture, and has a solid track record of delivering results.</p><p>StormFree is a remote working environment that enables team members to be based anywhere in Canada provided they are Canadian residents and have a stable, high-speed internet connection.</p><p><b>Your Role</b><br/>As a React Web Developer you will:</p><ul><li>write code that is logical, bug-free, and extensible</li><li>analyze, refactor, and maintain legacy code</li><li>design APIs, databases, and related models</li><li>write test cases and perform testing</li><li>embody the StormFree Way to help build and deliver quality products that meet or exceed the highest industry standards</li><li>embrace the remote work culture, building strong relationships with team members, managers, and stakeholders</li><li>engage with project managers to fulfill schedules and budget deliverables</li><li>contribute to and maintain project documentation, including estimates, procedures, and plans</li><li>create and deliver presentations to StormFree teams, management, and stakeholders</li></ul><p><b>Your Contribution</b></p><ul><li>solid understanding and experience with web front end frameworks (ReactJS, AngularJS, VueJS, Dojo Toolkit)</li><li>strong working experience with Redux, Thunk</li><li>skilled in Context API</li></ul><p>*<br/>knowledge of, or ability to learn, the following Libraries:</p><ul><li>Immutablitiy Helper</li><li>ReSelect</li><li>Jest and Enzyme Testing tools</li><li>effective at using supporting web languages (CSS/SASS, JS/JSX)</li><li>some experience with React Native Navigation, Higher Order Components and React Router</li><li>knowledge of ImmutableJS, Normalizr</li><li>ability to maintain legacy code as well as design new projects from scratch</li><li>ability to identify and communicate both potential issues and opportunities</li><li>adept at considering problems from all angles and contributing effectively to solution options</li><li>adaptable in a fast paced, dynamic, and growing organization</li><li>proficient in creating and delivering presentations</li><li>effective in interfacing with both technical and non-technical audiences</li><li>ability to work independently and collaboratively in a team environment</li><li>experience with version control (Git, GitLab, Repo)</li><li>strong written and oral English communication</li></ul><p>Preferred Skills include Knowledge of:</p><ul><li>moment, lodash</li><li>knowledge of pipeline and supporting tools (docker, composer, npm, etc.)</li><li>a variety of software development methodologies, such as iterative prototyping, Agile</li><li>Quality Assurance strategies and experience testing best practices</li><li>cryptography and cryptosystems (SKC, PKC, hashing, certificates)</li></ul><p>Preferred education includes:</p><ul><li>degree, preferably B.Sc. Engineering or Computer Science</li><li>diploma from a technical institution</li><li>relevant certifications from recognized training institutions</li></ul><p><b>Your Work Environment</b><br/>Your work space must have a:</p><ul><li>private work area, such as a rented space or a home office</li><li>stable, high-speed internet connection on a reliable network</li><li>computer with sufficient processing power to meet work commitments</li><li>office software suite for word processing, spreadsheets, and presentations</li><li>headset and camera for meetings</li><li>smartphone</li></ul><p><b>Terms: </b><br/>This is a contract role, working remotely. Compensation, based on experience and performance, is between $30-60 per hour.</p><p><b>Thank You: </b><br/>We thank you for your interest in working with StormFree. You will be contacted if you are selected to move forward with the next step in our process.</p><p>Job Type: Contract</p><p>Experience:</p><ul><li>Libraries: Immutablitiy Helper, ReSelect Jest, Enzyme Test: 1 year (Preferred)</li><li>Context API: 2 years (Required)</li><li>Redux, Thunk: 2 years (Required)</li><li>web front end frameworks (ReactJS, AngularJS, VueJS, Dojo): 3 years (Required)</li></ul>","84e7f9d469a254de":"<div><p>Our Web development team is at the heart of our business, and we&rsquo;re one of Canada&rsquo;s fastest growing tech companies. What more do you need to know!?<br>\n</p>\n<p>We&rsquo;re expanding quickly, and bringing new clients on board all the time. We need you (or someone like you) to come in and help drive our future success and compliment our work in other spaces like Augmented and Virtual Reality. That is, if you&rsquo;re a talented Front End Web Developer, with at least a couple of years developing and maintaining web applications.</p>\n<p>\nWe can guarantee you&rsquo;ll get to work across a ton of cool projects, platforms and technologies, creating a range of new web apps and experiences. As part of a small team, you'd dive straight into designing, developing and deploying web apps for a number of high profile clients.</p>\n<p>\nTechnically you're strong; you take ownership, but you're totally happy to keep learning and equally happy working out of one of our offices, as you are, on site with a client.</p>\n<p>\nWe're on the hunt for developers across all experience levels, so get in touch!</p><br>\n<p></p>\n<p><b>\nRESPONSIBILITIES</b></p>\n<ul>\n<li>Transform wireframes and mock-ups into working software</li>\n<li>Estimate tasks and manage time effectively</li>\n<li>Move seamlessly between projects, platforms and technologies</li>\n<li>Use workflow tools such as JIRA and Git</li>\n</ul><p><b>QUALIFICATIONS</b></p>\n<ul>\n<li>1+ years of experience developing and maintaining websites</li>\n<li>In-depth knowledge of modern JavaScript (ES6+), HTML5 and CSS</li>\n<li>Has worked with frameworks such as ReactJS, VueJS or Angular</li>\n<li>Proven ability to deliver software products from concept to submission</li>\n<li>Strong understanding of programming concepts and the software development lifecycle</li>\n<li>Understanding of Computer Science theory, Data Structures and Algorithms</li>\n<li>Good communicator with the ability to work in a team environment</li>\n<li>2-year degree or diploma (preferred), or equivalent experience</li>\n</ul><p><b>NICE TO HAVES</b></p>\n<ul>\n<li>4-year degree</li>\n<li>Experience using NPM, Yarn, Webpack, Rollup, Browserify, gulp, grunt</li>\n<li>Experience using Node.js, WordPress</li>\n<li>Back end or full stack development experience</li>\n<li>Deployment using Microsoft Azure, Amazon Web Services or Google Cloud</li>\n</ul><p><b>TO APPLY</b></p>\n<ul>\n<li>Please submit your Resume and Cover Letter</li>\n<li>All candidates must be willing and able to work onsite</li>\n<li>Please ensure that you are eligible to work in Canada prior to sending your application</li>\n</ul> <p><i>We thank all applicants for their interest, however, regret to inform only short-listed candidates will be contacted.</i></p></div><p></p>","c5564223c4f3121b":"<p><b>Job Description</b></p><p>We're looking for a talented engineer who can help us build an amazing product and shape the trajectory of our team. The ideal candidate is a creative self-starter with a solid background in full-stack JavaScript development.</p><p><b>What You’ll Do</b></p><ul><li>Collaborate with various stakeholders including Founders, Engineers, Data science teams to shape the best user experience</li></ul><ul><li>Improve existing technology to a modern React / Node stack, with the potential to write once use everywhere</li><li>Develop and ship new features to improve user experience and business goals</li><li>Work in an agile environment using Jira and Sprints</li><li>Give and receive code review feedback</li><li>Shape the engineering team and culture as an early employee</li></ul><ul><li>Mentoring new coop and developers.</li></ul><p><b>What We’re Looking For</b></p><ul><li>At least 5+ years of experience in frontend and backend development</li><li>Strong knowledge in JavaScript and JavaScript libraries/frameworks</li><li>Strong front end experience in HTML, CSS, JavaScript, and React.js</li><li>Strong back end experience using Node.js and Express</li><li>Strong knowledge of NoSQL data structures and models (MongoDB)</li><li>Experience with AWS is a plus</li><li>Experience with Git and Git workflow is a plus</li><li>Understanding of software engineering best practices and object-oriented designs</li><li>Knowledge and experience with using open source products</li></ul><p><b>Who You Are</b></p><ul><li>Ability to operate in a fast-paced agile and entrepreneurial startup environment</li><li>Excellent teamwork skills with an ability to reach out and get the work done with minimal supervision</li><li>Good communication skills and empathy</li><li>Good at asking the right questions, not just giving what you think are the right answers</li><li>Easy and fun to work with</li><li>Experience and love of dance and outdoor activities is a plus</li></ul><p><b>What It’ll Be Like</b></p><p>We’re a group of smart and fun people focused on building an amazing place to work. As a tech startup in order to achieve this dream, it requires us to move fast, stay hyper-focused, and put in the grind. We work really hard here, but it’s an extremely fun journey and our team makes it all worth it. It’s important to us that you enjoy the work and achieve your personal goals. We will always judge you on your results and nothing else.</p><p>Job Type: Full-time</p><p>Salary: $75,000.00 to $125,000.00 /year</p><p>Experience:</p><ul><li>ReactJS: 2 years (Required)</li><li>Node.Js: 3 years (Required)</li><li>HTML/CSS: 3 years (Required)</li></ul><p>Location:</p><ul><li>Vancouver, BC (Required)</li></ul>","5acd4f4727a8f3f0":"<p>PressCentric Software Solutions is looking for a looking for a capable web frontend developer to join our team.</p><p>About Us</p><p>PressCentric provides an innovative SaaS solution for printers and printer brokers that manages their entire business cycle - from creating an online presence and taking customer orders to processing and producing orders and, finally, shipping orders to the customer.</p><p>Required Skills</p><p>- Skilled in web application development<br/>- Knowledge of ReactJS and CSS frameworks (SemanticUI, Bootstrap)<br/>- Good understanding of web-related technologies such as HTML, XHTML, JSP, JavaScript, SEO, CSS<br/>- Strong testing, configuration and deployment skills.<br/>- Sound knowledge of Adobe Photoshop is a plus.</p><p>Our ideal candidate will have:</p><p>- 3+ years of software development experience in web applications<br/>- Related education<br/>- Outstanding verbal and written communication skills<br/>- The ability to work under pressure with multiple priorities<br/>- The ability to perform successfully under limited supervision</p><p>What we offer:</p><p>- Competitive Salary<br/>- Experience building a great software and being part of a Vancouver startup success story<br/>- Central downtown location, easy to reach by metro or bus.<br/>- Happy work environment and something to look forward to on Monday mornings</p><p>Please reply to this ad with your CV and cover letter describing your experience and expected compensation or apply directly via our web site: http://www.presscentric.com/about/careers</p><p>Job Type: Full-time</p><p>Experience:</p><ul><li>Javascript Development: 1 year (Preferred)</li><li>Web Development: 3 years (Preferred)</li><li>React Redux Development: 1 year (Preferred)</li></ul><p>Language:</p><ul><li>English (Preferred)</li></ul>","26dfa598da5cd341":"<div><h2 class=\"jobSectionHeader\"><b>Job ID 4009</b></h2><p>\nAt AbCellera, we are a young, collaborative, and driven company with innovation at our core. We are growing quickly and as we continue to take on the most challenging scientific problems, we are looking for a bioinformatician to join our talented team.</p><p><b>\nThe role:</b></p><p>\nOur research creates a huge amount of data. We need someone like you to help bridge the gap between complex biological data and life-changing insights. On any given day you might:</p><ul><li>\nExtend and improve production pipelines for analyzing single-cell and bulk immunoglobulin repertoire sequencing data</li><li>\nBuild new bioinformatic tools for internal R&amp;D priorities</li><li>\nWork closely with front-end and back-end developers to enable effective storage, processing, and visualization of large and complex datasets</li><li>\nCollaborate with wet-lab scientists to interpret and design experiments</li></ul><p><b>\nOur current tech stack:</b></p><ul><li>\nPython\n</li><li>Back-end powered by Django</li><li>\nFront-end in Angular or ReactJS, depending on the project</li><li>\nPostgreSQL database</li></ul><p><b>\nWhat we&rsquo;re looking for:</b></p><ul><li>\nA graduate degree (MSc or PhD) in Bioinformatics, Computational Biology, or a related field\n</li><li>Experience working in a team environment, collaborating on solutions, and sharing code</li><li>\nProficiency in at least one common coding language (Python preferred)</li><li>\nExperience working with high-throughput sequencing data\n</li><li>Experience modeling, designing, testing, and debugging code</li><li>\nA demonstrated ability to find creative and functional solutions to complicated problems</li><li>\nThe ability to express complex ideas in understandable ways, and to communicate effectively with people from different fields</li><li>\nExcellent documentation skills with impeccable attention to detail</li></ul><p><b>\nBonus qualifications, but not required:</b></p><ul><li>\nA good foundation in statistical analysis\n</li><li>An understanding of the basics and limitations of experimental protocols</li><li>\nA background in immunobiology</li><li>\nExperience with machine learning techniques, feature selection, and data exploration</li></ul><p><b>\nOffers &amp; Benefits:</b></p><ul><li>\nThe opportunity to make a real difference, working on challenging problems that matter</li><li>\nAn attractive compensation package, including health and lifestyle benefits</li><li>\nA minimum of 3 weeks&rsquo; vacation</li><li>\nA seat in our beautiful new office in Vancouver, BC, Canada (just off Cambie Street - with plenty of good lunch options nearby)</li><li>\nOpportunities for personal and professional development\n</li></ul><p><b>To Apply:</b></p><p>\nPlease send us your application through our website and refer to <b>Job ID 4009</b> in your cover letter. We apologize in advance, but we receive a large volume of applications, and can only contact those who are selected for an interview.</p></div>","0e4c79028de04f26":"<p>Job Description<br/>AOT Technologies is looking for experienced Full Stack Developers for an immediate opportunity in Victoria, British Columbia.</p><p>**Paid Relocation to Victoria ***</p><p>This is a great opportunity to work with a young and creative IT organization with a great culture! We offer competitive salaries, ongoing training opportunities, as well as a strong work/life balance.</p><p>Some of the job responsibilities:</p><ul><li>Creation and Maintenance of Web and Mobile Applications</li><li>Create world-class user interfaces</li></ul><ul><li>Collaborate with different stakeholders to prepare various technical documentation</li></ul><ul><li>Software Analysis and design</li></ul><ul><li>Unit testing, preparation of test scripts</li></ul><ul><li>Software deployment and DevOps</li></ul><p>Required Skills:</p><ul><li>Degree/Diploma in Computer Science or equivalent</li><li>Passion for UI/UX</li><li>Experience creating RESTful JSON APIs</li><li>Excellent skills/experience in JavaScript frameworks - React, Angular, View.js</li><li>Knowledge of front-end technologies like HTML5, JS/ES6, CSS/Sass</li><li>Experience in one or more modern programming languages like Python, Java, and C#</li><li>Experience deploying and maintaining backend web services</li><li>Excellent Database design skills and experience with DBs like - MySQL and MongoDB</li><li>Great verbal and written communication skills</li><li>Comfortable with Git and GitHub</li><li>Legal working status in Canada, please note that we cannot sponsor work permits for this position</li></ul><p>Nice to have:</p><ul><li>DevOps skills or interest</li><li>Active on GitHub or Stack Overflow.</li></ul><p>This job will be based out of our Victoria office:</p><p>325-1207 Douglas St<br/>Victoria, BC V8W 2E7</p><p>Job Type: Full-time</p><p>Salary: $70,000.00 to $85,000.00 /year</p><p>Job Type: Full-time</p><p>Salary: $70,000.00 to $85,000.00 /year</p><p>Experience:</p><ul><li>HTML/CSS: 6 years (Preferred)</li><li>AngularJS: 2 years (Preferred)</li><li>ReactJS: 2 years (Preferred)</li></ul>","c167a2f251584407":"<p><b>Role : Lead Developer (Frontend , ReactJS)</b></p><p><b>Duration : Long Term Contract</b></p><p><b>Job Description: </b></p><ul><li>Minimum demonstrable professional experience of 7+ years of which at least 3 years as Frontend Stack Developer in React JS or at least they should have handled 2 projects in React JS.</li><li>JavaScript proficiency, including DOM manipulations</li><li>Thorough understanding of React JS & its core principles</li><li>Must have Experience with popular React Js workflows (Redux)</li><li>Familiarity with RESTful APIs</li><li>Experience building dynamic component with React/Redux</li><li>Jason formatting and Javascript object modelling, HTML,CSS</li><li>Hands on experience with unit testing framework like JEST</li><li>Proven interpersonal skills and attitude</li><li>Ability to handle customers</li></ul><p><b>Key Responsibilities: </b></p><ul><li>Developing new use-facing features using React JS</li><li>Building reusable components and front-end libraries for future use</li><li>Refactoring of the existing components in the platform, according to the needs of the business.</li><li>Implement the automatic tests associated with the frontend layer, both integration and JEST</li><li>Analyzing the requirements and estimating the effort</li></ul><p>Job Type: Contract</p><p>Experience:</p><ul><li>Frontend Development: 5 years (Required)</li><li>React.JS: 3 years (Required)</li></ul><p>Location:</p><ul><li>Vancouver, BC (Preferred)</li></ul>","2d4a0b8b6642748a":"<div><p>INTRO</p><p>\nAs a developer with solid, pixel-perfect HTML/CSS skills, you will be responsible for supporting our clients' experimentation activities by building test variations, and providing split testing &amp; web analytics technical implementation with the support of WiderFunnel's Technical Lead.</p><p>\nAt WiderFunnel, we are leaders in validation, known for building proven growth programs for leading companies. We deliver results for clients &mdash; fast, as a premium solution, with high touch service.</p><p>\nWe are a diverse and inclusive team rooted in a foundation of respect and openness. Our company values &ndash; grit, maverick, curiosity, integrity, and real &ndash; are at the center of how we hire, how we work, and how we treat one another. At WiderFunnel, you can bring your most authentic self to work, merging your personal and professional lives together.</p><p></p><br>\n<p>\nARE YOU</p><ul><li>\nTechnologically savvy, always meeting and exceeding high standards of accuracy and quality?</li><li>\nCapable of working within established systems, standards and procedures?</li><li>\nAble to identify technical problems and develop sound, carefully thought-out solutions?</li><li>\nA firm, factual communicator, able to complete quick decisions in response to changing conditions?</li></ul><p></p><br>\n<p>\nACCOUNTABILITIES</p><ul><li>\nSupport WiderFunnel's A/B testing projects by developing primarily on client's web front-end code variations for our clients A/B and MVT tests using HTML/CSS and JS DOM-manipulation (ES6, jQuery, AJAX, SASS, Responsive and Mobile Design, Testing &amp; Debugging and Cross Browser development)</li><li>\nDevelop simple experiments using a front-end framework (eg. React, Angular, Vue, etc..) and Single Page App (SPA) website</li><li>\nDevelop WiderFunnel internal project management and participate in technical R&amp;D projects</li><li>\nUnderstand basic workflow and features of A/B tools like Optimizely, VWO, Adobe Target, Google Optimize, A/B Tasty, etc..</li><li>\nEvaluate business goals and strategies to develop tracking, tagging, segmentation (custom attributes) methods to provide accurate data-based results to measure success</li><li>\nPerform quality assurance tests with excellent debugging skills.</li><li>\nAssist Delivery team with any pre-design/pre-development solutions</li><li>\nBasic knowledge of tracking and analytics service such as GA, GTM, Hotjar, FullStory, etc...</li><li>\nBasic knowledge design skills using tool like Photoshop, Sketch, Zeplin, etc</li><li>\nBasic knowledge of DevOps skills on how to setup localhost environment (ie. Node, PHP)</li><li>\nUnderstand how to use internal project management (such as JIRA, Asana, gSuite)</li><li>\nUnderstand basic GIT/Version control workflow such as Repos, Branches, Pull Request (PR), Clone, Commit, Push, Rebase, Resolve Conflict, etc&hellip;</li><li>\nSupport Delivery team in weekly call to answer any technical issue from clients if needed</li></ul><p></p><br>\n<p>\nQUALIFICATIONS</p><ul><li>\n3+ years front end technologies: Javascript (ES6), CSS/SASS, NodeJS</li><li>\n1+ years front end framework such as AngularJS, ReactJS, or VueJS</li><li>\nExperience in responsive, mobile/app development.</li><li>\nJIRA experience would be nice to have</li><li>\nPhotoshop experience would be nice to have</li><li>\nYou have a github account and contribute to online developer communities.</li><li>\nNatural maverick with curiosity to problem solve</li></ul></div>","4235e89c6b76a9f1":"<div><div><p><b>Rival Technologies </b>www.rivaltech.com is a market research technology company based in Vancouver. As a startup our philosophy is simple - there are three ingredients that drive innovation: measured risk, a desire to learn, and a willingness to experiment. At Rival we strive to develop products and services that boost the value of communities. Good design is at the heart of our culture, and we take enormous pride in balancing the utility of a solution with the usability, and desirability that our customers expect.</p>\n</div>\n<div><p>Rival is currently looking for an enthusiastic and driven Junior Software Engineer to join our team.</p>\n</div>\n<div><p><b>R</b><b>equirements:</b></p>\n<ul>\n<li>Strong verbal and written communication skills</li>\n<li>Willingness to learn new skills and ramp up quickly</li>\n<li>Ability to work with minimal guidance</li>\n<li>Good instincts in solving technical problems</li>\n<li>2+ years of experience with JavaScript</li>\n<li>Experience with ReactJS, Angular, or similar (please include a demo project to show)</li>\n<li>Experience with git</li>\n<li>Experience with peer-code reviews</li>\n<li>Good understanding of CSS and HTML</li>\n<li>Great communication</li>\n</ul>\n</div><div></div><div><div><p><b>Nice to have</b><b>s</b><b>:</b><b>\n</b></p><ul><li>Experience with Redux</li>\n<li>Experience with GraphQL</li>\n<li>Experience with NodeJS</li>\n<li>Experience building REST APIs\n</li>\n</ul></div></div><div><div><p><br>\n<b>Job Description:</b></p>\n<ul>\n<li>Build an admin interface for customers to design bots, monitor their usage, and visualize the data they capture</li>\n<li>Build a modern, web-based chat client that allows users to interact with market research bots</li>\n<li>Use the latest web technologies such as React and GraphQL</li>\n<li>Work closely with backend engineers and QA to deliver features each sprint</li>\n<li>Participate in peer code reviews</li>\n<li>Deploy your code to AWS</li>\n</ul>\n</div></div><div><div><p><br>\n<b>Tell us about yourself</b></p>\n</div>\n<div><p>Here are a few things that we&rsquo;d be interested to hear:\n</p><ul><li>Share a project that you have worked on, a link to a blog or Github.</li>\n<li>Have you contributed to an (open-source) project in a software design capacity? Tell us more about it.</li></ul></div></div></div><p></p>","13cf6fea23fc2817":"<p><b>About PlaceSpeak</b></p><p>PlaceSpeak is a location-based citizen engagement platform that connects residents and citizen users with governments and businesses in their own neighborhoods. Our mandate is to promote meaningful dialogue on local issues. PlaceSpeak transforms the way people interact with local decision-makers and makes it possible to genuinely communicate based on where you live.</p><p><b>About the Role</b></p><p>We’re seeking a <i>Front End / React Developer intern</i>to join our Vancouver, BC based team. It's a small team and you'll have an opportunity to have a significant impact on the product. If you pride yourself on exacting attention to detail, thrive under tight deadlines in a fast paced and changing environment, and have a strong sense of humour, then this is the job for you.</p><p><b>Responsibilities</b></p><p>The Front End / React Developer will:</p><ul><li>Craft responsive web experiences that are secure, fast and high performing</li><li>Help identify and solve front-end web development issues experienced by clients</li><li>Ensure a cohesive experience across different browsers and devices</li><li>Work closely with the design team to define and implement product features</li><li>Define and implement robust and efficient UI architecture</li><li>Disburse UI best practices throughout the entire engineering team</li></ul><p><b>Requirements</b></p><ul><li>2+ years experience building high performance, reliable web enterprise-level applications and delivering pixel perfect code.</li><li>Experienced with ReactJS, preferably ES5, and React-Redux</li><li>Advanced knowledge of JavaScript, HTML5, and CSS preprocessors (eg. Less).</li><li>Exposure and experience with automating daily tasks (Grunt/Gulp/etc.)</li><li>Experience working with REST APIs</li><li>Strong UX and design sensibilities, and a desire to sweat the small stuff</li><li>Excellent communication skills, both written and oral</li><li>A team player, able to effectively collaborate and build relationships over any medium of communication</li></ul><p><b>Preferred (but not required)</b></p><ul><li>Experience with Linux</li><li>Experience with AngularJS</li><li>Experience with Python, Django</li><li>Experience with Jira (or equivalent defect management application/system)</li><li>Experience with agile and scrum development methodologies</li><li>Familiar with accessibility (WCAG2 AA) best practices</li><li>Experience using source control software (Git)</li></ul><p><b>Additional Details</b></p><p>This position is offered with funding through the Government of Canada's Digital Skills For Youth Program and is open to applicants aged 15-30 (inclusive).</p><p>Candidates must have recently (within two years prior to the start of their internship) completed post-secondary studies.</p><p>All applicants must be <b>Canadian citizens, permanent residents of Canada</b>, <b>or have refugee status in Canada.</b> <b>Work permits are not eligible. And be eligible to work in Canada.</b></p><p>This is a 5-10 month contract position based in Vancouver, BC with an hourly rate between $16 - $20/hour depending on experience. Please apply with a cover letter, resume and link your portfolio.</p><p>Job Type: Internship</p><p>Experience:</p><ul><li>JavaScript: 2 years (Required)</li><li>React JS: 2 years (Required)</li></ul><p>Location:</p><ul><li>Vancouver, BC (Required)</li></ul>","d1a2e82c4dffd86e":"<p>About us:</p><p>www.elireport.com</p><p>Eli Technologies is an emerging real estate technology company based in Vancouver, BC. Our flagship product, <b><i>Eli Report</i></b>, is a SaaS platform that helps real estate professionals, their clients and home-owners make sense of strata/condo documentation quickly and efficiently. Eli Report leverages NLP to read and summarize key restrictions and issues present in condo documentation, leading to more efficient due diligence and more informed home buyers and home owners.</p><p>Founded in 2017, we are a small team of entrepreneurial individuals (+ an octopus!) enthusiastic about multi-family living, real estate and bringing technology to an industry that needs more of it. We support transparency in the real estate market, and love to analyze unique data in new ways. As our VP, Product, you are technically-oriented, have an entrepreneurial mind and will be instrumental in developing our product road map and product strategy in our local market, and in other jurisdictions across Canada and the US.</p><p>Key Responsibilities:</p><ul><li>Day-to-day management of product backlog, running bi-weekly sprints with a team of local software developers, testing and deploying builds</li><li>Investigate and guide implementation of additional technologies to improve both user-facing and admin-facing experience/functionality and reporting</li><li>In conjunction with management, brainstorm product evolution across users and geographies</li><li>Collaborate with our sales and customer service team to understand user needs and feedback, using this information to tweak the product road map.</li><li>Review Eli’s current information systems, and develop a strategy which will allow the company to scale, secure and access its proprietary data</li><li>Grow our technical team in conjunction with management</li></ul><p>Requirements:</p><ul><li>5+ years of experience in product management, developing and executing consumer-focused SaaS product strategies, delivering product that customers love</li><li>Experience with and a passion for Agile software development and project management</li><li>Experience working with HTML5, ReactJS, Node.js, GraphQL, MongoDB, Tensorflow, AWS suite</li><li>Passion for data-driven products, inventorying and analyzing large sets of data</li><li>Past experience working with natural language processing and other machine learning methods is an asset</li></ul><p>Compensation:</p><p>Competitive compensation package with benefits.</p><p>We are excited to hear from you! Please submit your <b><i>resume and cover letter</i></b> directly through Indeed.</p><p>Job Type: Full-time</p><p>Salary: $90,000.00 to $120,000.00 /year</p><p>Location:</p><ul><li>Vancouver, BC (Preferred)</li></ul>","56869a325e1abd8d":"<p>We are a stealthy startup in Vancouver developing products for Cyber Security research and education. We attract the types of individuals that love to code, hack, and help teach others. Our culture is unbiased and welcoming to all types. We have not won any awards yet, but we are pretty sure we will soon.</p><p>Do you desire to work for a company where your input is valued, and your intelligence is given a place to shine. As a Senior/Intermediate Full stack Developer at CyberWerkx, you will be given this opportunity while you code a lot. Rather than being a cog in the wheel, you will be an intricate part of the success and growth of our company.</p><p>NOTE: This is for a very strong front end role, your React and GraphQL needs to be on point for a scalable production environment. This position is for Vancouver BC but we are open to remote work by the right candidate located anywhere in Canada.</p><p>You must be eligible for a Security Clearance - Canadian Citizen or Permanent Resident.</p><p><b>What You’ll Do</b></p><ul><li>Create and maintain beautiful frontend components in React that integrate with our APIs</li><li>Be a senior engineer on the team, performing code reviews, mentoring junior developers, and providing direction for platform architecture</li><li>Evangelize user experience and champion a customer-centric product philosophy.</li><li>Work closely with product managers to transform business requirements into well articulated, functional requirements</li><li>Provide direction and feedback to a diverse team of programmers and stakeholders</li><li>Iterate designs to meet changing requirements</li></ul><p><b>Who You Are</b></p><p>The perfect candidate will be comfortable being the sole front end developer. Working alongside two back end developers, this role is ideal for an individual with a teamwork oriented mindset. As a Front-End Developer, you must be open to test driven development ideas and understand the importance of building quality into your software.</p><p>We need someone who can guide the team through the development process, promote and implement bleeding-edge concepts and document their work so it can be replicated or modified later.</p><p><b>You are an expert in: </b></p><ul><li>Solid experience with React 16.8+</li><li>Solid understanding of Redux & Sagas</li><li>Solid use of Apollo Client/Server</li><li>React Router v4</li><li>Javascript</li><li>CSS/SASS and HTML</li></ul><p><b>Also... You have experience with: </b></p><ul><li>UI/UX</li><li>AntD Library</li><li>DraftJS</li><li>Node JS</li><li>Express</li><li>Postgres</li><li>Performance Optimization</li><li>Implementing Regression Testing</li><li>Handling user & team permissions on the front end</li></ul><p><b>Extras</b></p><ul><li>Docker</li><li>Experience coding in an AWS environment</li><li>Security</li><li>Working knowledge of agile software development and the scrum methodology</li><li>Git and Gitlab</li><li>Jira</li></ul><p><b>What We Offer</b></p><p>This role offers a lot of professional development. In this environment, producing code of the highest quality is the aim, and you are surrounded by like-minded developers who are working towards the same goal. This is an opportunity to work for a well-established and financially stable company. You also receive a comprehensive benefits package and free Nespresso. We have our own private office space located in beautiful Kitsilano.</p><p><b>Bonus Brownie Points</b></p><ul><li>You are a Marvel Fan ... Mar-Vell too</li><li>We all have a Nintendo Switch, and we are all just getting into Diablo 3 right now</li></ul><p>Job Types: Full-time, Contract</p><p>Salary: $70,000.00 to $110,000.00 /year</p><p>Experience:</p><ul><li>ReactJS: 3 years (Required)</li><li>HTML/CSS: 3 years (Preferred)</li><li>Javascript: 5 years (Preferred)</li><li>GraphQL: 3 years (Preferred)</li></ul>","3cf8cb1897421e14":"<p><b>JOB SUMMARY</b></p><p>YOU</p><p>Are a highly motivated individual with extensive experience in website and web application development. Able to demonstrate an in-depth understanding of both front end and back end programming using Javascript and your backend language of choice. Be a part of a small, talented team, delivering innovative marketing solutions to a unique client base. Want to contribute your strengths to an often inspiring, occasionally chaotic open-office environment.</p><p>As a developer, you hate to repeat yourself. You know when and how to re-factor your code. Enforcing consistency and re-usability across the code-base is your motto and you always think about the future. You aspire to create easily read, efficient code and consistently strive to improve upon your work and yourself with each task. You like to research and share the latest applicable technologies so you can ensure the best tools are always being used.</p><p>WE</p><p>Are Storydriven, a boutique creative services agency based in North Vancouver, with an international client base. If you think our work and your skills sound like a good fit, drop us a line saying why.</p><p><b>JOB SUMMARY</b></p><p><b>Duties & Responsibilities</b></p><ul><li>Develop front end components and systems for both standalone touchscreen, desktop, and mobile devices</li><li>Develop/modify back end systems using a backend language of your choice to meet client needs.</li><li>Develop/modify performant, responsive and clean websites with a supporting CMS.</li><li>Support the maintenance and evolution of existing applications and the design and delivery of new.</li><li>Collaborate with the development team and company on processes, features and recommendations.</li><li>Architect, develop, document, and debug sites</li><li>Ensure code integrity, reuse, optimisation and organization</li><li>Apply the appropriate standards, processes, procedures, and tools throughout the development life cycle</li><li>Ensure software standards are met</li><li>Properly escalate issues to meet deadlines</li><li>Be attentive to details and enforce quality</li><li>Communicate effectively with clients</li></ul><p><b>Requirements</b></p><ul><li>1+ years of Angular2+ / ReactJS / VueJS experience, with experience building modular components</li><li>3+ years of Javascript experience</li><li>2+ years of experience with PHP and Wordpress</li><li>2+ years of experience with MySQL / PostgreSQL</li><li>1+ years experience with a modern modern backend language/framework</li><li>Experience with server optimisation and Docker</li><li>In-depth understanding of core web technologies (HTTP, HTML, CSS, jQuery, AJAX, JSON, XML, Web 2.0, etc.) and principles</li><li>Experience with modern front-end tools, code optimisation and performance (Gulp, Webpack, CSS pre-processors, task runners...)</li><li>Experience with Bootstrap and responsive development</li><li>Experience with creating and using REST APIs</li><li>Experience with Git</li><li>Experience with Continuous Delivery tools (Codeship, Bitbucket Pipelines, etc.)</li><li>Advanced problem solving skills and the ability to work with innovative solutions</li><li>Strong analytical skills with the ability to assess complex situations and understand key issues quickly</li><li>Ability to adapt in a dynamic work environment and make independent decisions</li><li>Demonstrated ability to prioritize work load and meet multiple deadlines</li><li>Experience in navigating cross-functional teams</li><li>Excellent verbal and written communications</li><li>A proven track record in task delivery</li></ul><p><b>Qualifications</b></p><ul><li>AngularJS experience an asset</li><li>Roots Wordpress Development an asset</li><li>OctoberCMS experience an asset</li><li>Django/Python experience an asset</li><li>Node experience an asset</li></ul><p><b>The People</b></p><ul><li>Report to Creative Director</li><li>Interact internally with Project Coordinator, Designers, Programmers, Accountant</li><li>Interact externally with Clients and suppliers as required</li></ul><p><b>Timing</b></p><ul><li>Applicants will be shortlisted and we will contact you for an interview.</li></ul><p>Job Type: Full-time</p>"}